
#Область СлужебныеПроцедурыИФункции

Процедура ОбновитьЗначенияРеквизитовПечати(ТекущийОбъект, ИзмененныеРеквизиты) Экспорт
	
	Для каждого ЭлементСтруктуры Из ИзмененныеРеквизиты Цикл
		
		ТекущийОбъект.Объект[ЭлементСтруктуры.Ключ] = ЭлементСтруктуры.Значение;
		
		Если НЕ ТекущийОбъект.Модифицированность Тогда
			
			ТекущийОбъект.Модифицированность = Истина;
			
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

Функция ПредложитьЗаполнитьРеквизитыОрганизации(ПараметрыПечати) Экспорт
	
	ОткрытьФормуЗаполненияРеквизитовДляПечати(ПараметрыПечати, "ПодписьРуководителя,ПодписьГлавногоБухгалтера,ИНН,КПП,БанковскийСчетПоУмолчанию,ФайлЛоготип,ЮрАдрес");
	
КонецФункции

Функция ПредложитьЗаполнитьРеквизитыОрганизацииСФаксимильнойПодписью(ПараметрыПечати) Экспорт
	
	ОткрытьФормуЗаполненияРеквизитовДляПечати(ПараметрыПечати, "ПодписьРуководителя,ПодписьГлавногоБухгалтера,ИНН,КПП,БанковскийСчетПоУмолчанию,ФайлЛоготип,ЮрАдрес,ФайлФаксимильнаяПечать");
	
КонецФункции

Процедура ОткрытьФормуЗаполненияРеквизитовДляПечати(ПараметрыПечати, ИменаРеквизитовДляЗаполнения)
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("ИмяМенеджераПечати", ПараметрыПечати.МенеджерПечати);
	ПараметрыФормы.Вставить("ИменаМакетов", ПараметрыПечати.Идентификатор);
	ПараметрыФормы.Вставить("ПараметрКоманды", ПараметрыПечати.ОбъектыПечати);
	ПараметрыФормы.Вставить("ИменаРеквизитовДляЗаполнения", ИменаРеквизитовДляЗаполнения);
	ПараметрыФормы.Вставить("ПараметрыПечати", Новый Структура);
	Для Каждого КлючИЗначение Из ПараметрыПечати Цикл
		Если ТипЗнч(КлючИЗначение.Значение) = Тип("УправляемаяФорма") Тогда
			Продолжить;
		КонецЕсли;
		ПараметрыФормы.ПараметрыПечати.Вставить(КлючИЗначение.Ключ, КлючИЗначение.Значение);
	КонецЦикла;
	
	ПараметрыФормы.Вставить(
	"Ключ",
	УправлениеНебольшойФирмойСервер.ОрганизацияИзПараметраКоманды(ПараметрыФормы.ПараметрКоманды));
	
	Если ЗначениеЗаполнено(ПараметрыФормы.Ключ) Тогда
		
		ФормаЗаполненияРеквизитовДляПечати = ОткрытьФорму(
		"Справочник.Организации.Форма.ФормаЗаполненияРеквизитовДляПечати",
		ПараметрыФормы,
		Строка(Новый УникальныйИдентификатор));
		
		Если ФормаЗаполненияРеквизитовДляПечати <> Неопределено Тогда
			Возврат;
		КонецЕсли;
		
	КонецЕсли;
	
	УправлениеПечатьюКлиент.ВыполнитьКомандуПечати(
	ПараметрыФормы.ИмяМенеджераПечати,
	ПараметрыФормы.ИменаМакетов,
	ПараметрыФормы.ПараметрКоманды,
	ПараметрыПечати.Форма,
	ПараметрыФормы);
	
КонецПроцедуры

Процедура ОбработкаКомандыПечатиЦенниковИЭтикетокНаПринтереЭтикеток(ПараметрыПечати) Экспорт
	
	Обработка = ПараметрыПечати.ОбъектыПечати[0];
	
	Если Обработка.Запасы.НайтиСтроки(Новый Структура("Выбран", Истина)).Количество() = 0 Тогда
		ПоказатьПредупреждение(, НСтр("ru = 'Не выбрано ни одного товара'"));
		Возврат;
	КонецЕсли;
	
	Если ПараметрыПечати.Свойство("ИдентификаторФормы") Тогда
		ИдентификаторФормы = ПараметрыПечати.ИдентификаторФормы;
	Иначе
		ИдентификаторФормы = ПараметрыПечати.Форма.УникальныйИдентификатор;
	КонецЕсли;
	
	ДанныеДляПринтераЭтикеток = УправлениеНебольшойФирмойВызовСервера.ПодготовитьСтруктуруДанныхЦенниковИЭтикетокДляПринтераЭтикеток(Обработка, ПараметрыПечати.МенеджерПечати, ПараметрыПечати.ТекущийРазмер);
	
	Если ДанныеДляПринтераЭтикеток.Количество() > 0 Тогда
		
		Для Каждого ТекМакет Из ДанныеДляПринтераЭтикеток Цикл
			
			МенеджерОборудованияКлиент.НачатьПечатьЭтикеток(Неопределено, ИдентификаторФормы, ТекМакет.XML, ТекМакет.Этикетки);
			
		КонецЦикла;
		
	КонецЕсли;
	
КонецПроцедуры

#Область КлиентскиеМетодыПечати

Функция ПечатьКонтактнойИнформации(ПараметрыПечати) Экспорт
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("КонтрагентыНачальноеЗначение", ПараметрыПечати.ОбъектыПечати);
	
	Если ПараметрыПечати.ОбъектыПечати.Количество() > 0 Тогда
		КлючУникальности = ПараметрыПечати.ОбъектыПечати[0];
	Иначе
		КлючУникальности = Ложь;
	КонецЕсли;
	
	ОткрытьФорму("Справочник.Контрагенты.Форма.ФормаКонтактнойИнформации", ПараметрыФормы, , КлючУникальности);
	
КонецФункции

Функция ПечатьКонверта(ОписаниеКоманды) Экспорт
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("ОбъектыПечати", ОписаниеКоманды.ОбъектыПечати);
	
	ОткрытьФорму("Обработка.ПечатьКонвертов.Форма", ПараметрыФормы);
	
КонецФункции

#КонецОбласти

#Область ПриИзмененииРеквизитовФорм

Процедура ПриИзмененииДоговораКонтрагента(ДоговорПослеИзменения, ОснованиеПечатиСсылка, ОснованиеПечати) Экспорт
	
	Если НЕ ЗначениеЗаполнено(ДоговорПослеИзменения) Тогда
		
		Если НЕ ЗначениеЗаполнено(ОснованиеПечатиСсылка)
			ИЛИ ТипЗнч(ОснованиеПечатиСсылка) = Тип("СправочникСсылка.ДоговорыКонтрагентов") Тогда
			
			ОснованиеПечатиСсылка = Неопределено;
			ОснованиеПечати = "";
			
		КонецЕсли;
		
	ИначеЕсли ЗначениеЗаполнено(ДоговорПослеИзменения) Тогда
		
		Если НЕ ЗначениеЗаполнено(ОснованиеПечатиСсылка)
			ИЛИ ТипЗнч(ОснованиеПечатиСсылка) = Тип("СправочникСсылка.ДоговорыКонтрагентов") Тогда
			
			ОснованиеПечатиСсылка = ДоговорПослеИзменения;
			ОснованиеПечати = Нстр("ru = 'Договор: '") + Строка(ДоговорПослеИзменения);
			
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#КонецОбласти